Descriptor:
  Name: SampleDefenderKQL
  DisplayName: My Sample Defender KQL Plugin
  Description: Skills to query email logs in M365 Advanced Hunting
  Settings:
    - Name: TenantId
      Description: Your Azure Tenant ID where the Sentinel workspace is in.
    - Name: SubscriptionId
      Description: Your Azure Subscription ID where the Sentinel workspace is provisioned.
    - Name: WorkspaceName
      Description: The name Sentinel workspace that you'd like to reference.
    - Name: ResourceGroupName
      Description: The Resource Group where the Sentinel workspace is provisioned..

  SupportedAuthTypes:
    - None
	
SkillGroups:
  - Format: KQL
    Skills:
      - Name: GetLatestEmailsByRecipient
        DisplayName: Get Latest Emails By Recipient
        Description: Fetches the latest emails received by the user with the specified email address
        Inputs:
          - Name: email
            Description: The email address of the recipient
            Required: true
        Settings:
          Target: Sentinel
          TenantId: '{{TenantId}}'
          SubscriptionId: '{{SubscriptionId}}'
          ResourceGroupName: '{{ResourceGroupName}}'
          WorkspaceName: '{{WorkspaceName}}'
          Template:
            EmailEvents
            | where RecipientEmailAddress =~ '{{email}}'
            | project Timestamp, NetworkMessageId, SenderFromAddress, SenderDisplayName, Subject, DeliveryLocation
            | top 100 by Timestamp desc