# Authors: Rick Kotlarz ~ https://github.com/RickKotlarz
# Updated 12-Dec-2024

Descriptor:
  Name: Custom email investigation
  DisplayName: Custom email investigation
  Description: This plugin provides KQL queries to perform e-mail and mailbox investigations. https://github.com/Azure/Copilot-For-Security
  Icon: https://raw.githubusercontent.com/RickKotlarz/icons/refs/heads/main/Microsoft%20Entra%20architecture%20icons%20-%20Oct%202023/Microsoft%20Entra%20architecture%20icons%20-%20Oct%202023/Microsoft%20Blue%2048x48%20Grey%20%26%20Blue%20Icon/Mail%20Error.svg
  # Source: https://github.com/RickKotlarz/icons/tree/main/Microsoft%20Entra%20architecture%20icons%20-%20Oct%202023/Microsoft%20Entra%20architecture%20icons%20-%20Oct%202023/Microsoft%20Blue%2048x48%20Grey%20%26%20Blue%20Icon

  Settings:
    - Name: TenantId
      Description: Your Azure Tenant ID where the Sentinel workspace is in.
      HintText: Enter your Azure Tenant ID
      SettingType: string
      Required: true
    - Name: SubscriptionId
      Description: Your Azure Subscription ID where the Sentinel workspace is provisioned.
      SettingType: string
      Required: true
      HintText: Enter your Azure Subscription ID.
    - Name: WorkspaceName
      Description: The name Sentinel workspace that you'd like to reference.
      SettingType: string
      Required: true
      HintText: Enter the Sentinel workspace that you'd like to reference.
    - Name: ResourceGroupName
      Description: The Resource Group where the Sentinel workspace is provisioned..
      SettingType: string
      HintText: Enter your Resource Group where the Sentinel workspace is provisioned.
      Required: true

  SupportedAuthTypes:
    - None
   
SkillGroups:
  - Format: KQL
    Skills:

      - Name: GetUserMailboxRules
        DisplayName: Get user mailbox rules over a given time frame
        Description: |
          Get user mailbox rules over a given time frame
        ExamplePrompts:
          - Get mailbox rules for user over the last 7 days using the OfficeActivity KQL table
          - Get mailbox rules for user using the OfficeActivity KQL table
        Inputs:
          - Name: TimeFrameToSearch
            PlaceholderValue: The time range for the query (e.g., 1d, 7d)
            Description: Time range to perform a KQL query in the format of day number followed by `d`.
            DefaultValue: 7d
            Required: false
          - Name: UserMailBox
            PlaceholderValue: Users e-mail mailbox address
            Description: Users e-mail mailbox address
            DefaultValue: 
            Required: true
        Settings:
          Target: Sentinel
          TenantId: '{{TenantId}}'
          SubscriptionId: '{{SubscriptionId}}'
          ResourceGroupName: '{{ResourceGroupName}}'
          WorkspaceName: '{{WorkspaceName}}'
          Template: |-
            // The following data is used by expert SOC Analysts specializing in threat hunting mailbox-based attacks. The output will be used to analyzing mailbox activity, specifically rule creations or modifications that may indicate compromise. Common adversary techniques involve creating new email rules that redirect messages to an RSS feed folder or similar locations as well as forwarding and deleting sensitive information. Keywords that may indicate a potential risk within the parameters JSON indicating keywords include 'RSS','alert', 'daemon', 'did you', 'hack', 'hacked', 'hacker', 'helpdesk', 'IT', 'link', 'mimecast', 'phish', 'scam', 'security', 'suspicious', 'password', 'secret', 'key', and 'token'. Additionally, consider any other keywords or patterns that may represent Indicators of Compromise (IoCs) based on current or evolving threats.
            // 1. For each user, assess whether the analyzed actions are likely related to a user's mailbox being compromised.
            // 2. For each action analyzed, provide a risk confidence score using the following levels 'Low', 'Medium', 'High', 'Critical'.
            // 3. For each risk confidence score, offer a brief explanation for the assigned confidence score, citing specific keywords, patterns, or behaviors observed in the data.
            // 4. For each rule outlined within the parameters JSON, provide a summary.
            // Example response in bullet format for each user:
            // UserId: [User email address denoted as UserId]
            // Risk Confidence Level: [Low/Medium/High/Critical]
            // Reasoning: [Include identified patterns, matched keywords, or anomalous behaviors identified from the Operation and Paremeters JSON.]            
            // Date, time, & mailbox operation: [Timestamps from TimeGenerated]
            // Parameters Rule Summary: [Provide a summary of each rule identified within the parameters JSON field]
            // Client IP: [IP address denoted as ClientIP_WithoutPort]
            let UserMailBox = "{{UserMailBox}}";
            let TimePeriod = {{TimeFrameToSearch}};
            OfficeActivity
            | where TimeGenerated >= ago(TimePeriod)
            | extend EST = datetime_utc_to_local(TimeGenerated, "US/Eastern")
            | where tolower(UserId) in (UserMailBox)
            | where Operation in ("Add-MailboxPermission", "New-InboxRule", "Set-InboxRule")
            // Operations less commonly used by attackers: "Set-Mailbox", "New-TransportRule", "Set-TransportRule")            
            // Operations rarely used by attackers: "Add-MailboxPermission", "New-ManagementRoleAssignment"
            | extend ClientIP_WithoutPort = split(ClientIP, ":")[0]
            | project TimeGenerated, UserId, Operation, Parameters, ClientIP_WithoutPort
            // Parameters data in JSON denotes the mailbox rule that have been created.

#####################################################################################
      - Name: GetAllMailboxRules
        DisplayName: Gets mailbox rules for all users within the last 30 days
        Description: |
          Gets mailbox rules for all users within the last 30 days
        ExamplePrompts:
          - Get all mailbox rules using over the past 30 days
          - Get all mailbox rules for every user
          - Show me all mailbox rules
        Settings:
          Target: Sentinel
          TenantId: '{{TenantId}}'
          SubscriptionId: '{{SubscriptionId}}'
          ResourceGroupName: '{{ResourceGroupName}}'
          WorkspaceName: '{{WorkspaceName}}'
          Template: |-
            // The following data is used by expert SOC Analysts specializing in threat hunting mailbox-based attacks. The output will be used to analyzing mailbox activity, specifically rule creations or modifications that may indicate compromise. Common adversary techniques involve creating new email rules that redirect messages to an RSS feed folder or similar locations as well as forwarding and deleting sensitive information. Keywords that may indicate a potential risk within the parameters JSON indicating keywords include 'RSS','alert', 'daemon', 'did you', 'hack', 'hacked', 'hacker', 'helpdesk', 'IT', 'link', 'mimecast', 'phish', 'scam', 'security', 'suspicious', 'password', 'secret', 'key', and 'token'. Additionally, consider any other keywords or patterns that may represent Indicators of Compromise (IoCs) based on current or evolving threats.
            // 1. For each user, assess whether the analyzed actions are likely related to a user's mailbox being compromised.
            // 2. For each action analyzed, provide a risk confidence score using the following levels 'Low', 'Medium', 'High', 'Critical'.
            // 3. For each risk confidence score, offer a brief explanation for the assigned confidence score, citing specific keywords, patterns, or behaviors observed in the data.
            // 4. For each rule outlined within the parameters JSON, provide a summary.
            // Example response in bullet format for each user:
            // UserId: [User email address denoted as UserId]
            // Risk Confidence Level: [Low/Medium/High/Critical]
            // Reasoning: [Include identified patterns, matched keywords, or anomalous behaviors identified from the Operation and Paremeters JSON.]            
            // Date, time, & mailbox operation: [Timestamps from TimeGenerated]
            // Parameters Rule Summary: [Provide a summary of each rule identified within the parameters JSON field]
            // Client IP: [IP address denoted as ClientIP_WithoutPort]
            let TimePeriod = 30d;
            OfficeActivity
            | where TimeGenerated >= ago(TimePeriod)
            | extend EST = datetime_utc_to_local(TimeGenerated, "US/Eastern")
            | where Operation in ("Add-MailboxPermission", "New-InboxRule", "Set-InboxRule")
            // Operations less commonly used by attackers: "Set-Mailbox", "New-TransportRule", "Set-TransportRule")            
            // Operations rarely used by attackers: "Add-MailboxPermission", "New-ManagementRoleAssignment"
            | extend ClientIP_WithoutPort = split(ClientIP, ":")[0]
            | project TimeGenerated, UserId, Operation, Parameters, ClientIP_WithoutPort
            // Parameters data in JSON denotes the mailbox rule that have been created.
            
